In [2]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np

In [3]:
df1 = pd.read_csv("bengaluru_house_prices.csv")

In [6]:
print("Shape of the table :",df1.shape)

Shape of the table : (13320, 9)

In [5]:
df1.head(5)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

## Data Cleaning

### Drop unnecessary columns

From this dataset, we can delete few columns which are not relavent for price prediction.
Like area_type, availability, society

In [8]:
df1.area_type.value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

Carpet Area: Area which you can use, between the walls
Built-up Area: Include Walls thickness
Super built-up Area: Include area of other aminities as well like club house, gym etc.

We don't have any way to convert them to we will ignore entire column.

In [31]:
# Drop unnecessary columns

df2 = df1.drop(['area_type', 'availability', 'society'],axis='columns')

In [32]:
df2.shape

(13320, 6)

### Handle NA values

In [33]:
df2.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [34]:
df2.balcony.value_counts()

2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64

In [35]:
df2.balcony.unique()

array([ 1.,  3., nan,  2.,  0.])

In [39]:
# Fill NA of balcony with mean value

import math
mean = math.floor(df2.balcony.mean())
df2.balcony = df2.balcony.fillna(mean)

In [44]:
# Fill NA of bathroom with mean value

mean = math.floor(df2.bath.mean())
df2.bath = df2.bath.fillna(mean)

In [45]:
df2.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [46]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath           0
balcony        0
price          0
dtype: int64

In [92]:
# Now Drop rows with NA values as we can't do much about them

df3 = df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [93]:
df3.shape

(13303, 6)

### Feature Engineering (Create new feature bedroom from size column)

In [94]:
df3.head(5)

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

Here we can see that some rows have different type of values as size.
So create new column called bhk from size and delete size column.

In [95]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))
df3.bhk.unique()

/home/soham/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [96]:
df3 = df3.drop(['size'],axis='columns')
df3.head(3)

                   location total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi       2600   5.0      3.0  120.00    4
2               Uttarahalli       1440   2.0      3.0   62.00    3

In [97]:
df3.shape

(13303, 6)

### Feature Engineering (One sqft column)

In [98]:
df3.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [99]:
# Try to float the given number, 
# If it was not possible then it will goes to exception and return False from there.
# Else return True

def is_float(x):
    try: 
        float(x)
    except:
        return False
    return True

In [106]:
# Make deep copy

df4 = df3.copy()

In [107]:
df3[~df3['total_sqft'].apply(is_float)].head(10)

               location      total_sqft  bath  balcony    price  bhk
30            Yelahanka     2100 - 2850   4.0      0.0  186.000    4
56          Devanahalli     3010 - 3410   2.0      1.0  192.000    4
81          Hennur Road     2957 - 3450   2.0      1.0  224.500    4
122              Hebbal     3067 - 8156   4.0      0.0  477.000    4
137  8th Phase JP Nagar     1042 - 1105   2.0      0.0   54.005    2
165            Sarjapur     1145 - 1340   2.0      0.0   43.490    2
188            KR Puram     1015 - 1540   2.0      0.0   56.800    2
224         Devanahalli     1520 - 1740   2.0      1.0   74.820    3
410             Kengeri  34.46Sq. Meter   1.0      0.0   18.500    1
549         Hennur Road     1195 - 1440   2.0      0.0   63.770    2

In [108]:
df4.shape

(13303, 6)

We can see that some values in this column are in range or some other types as well.
So we need to clean them.

In [109]:
# If its in range format like 1195 - 1440 then take avg
# else return None, which we eventually drop

def convert(x):
    token = x.split('-')
    if len(token) == 2:
        return (float(token[0]) + float(token[1])) // 2
    
    try:
        return float(x)
    except:
        return None

In [110]:
df4.total_sqft = df4.total_sqft.apply(convert)
df4 = df4[df4.total_sqft.notnull()]
df4.head(3)

                   location  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      1440.0   2.0      3.0   62.00    3

In [111]:
df4.shape

(13257, 6)

In [112]:
df4.loc[30]

location      Yelahanka
total_sqft         2475
bath                  4
balcony               0
price               186
bhk                   4
Name: 30, dtype: object

### Feature Engineering (Make Price per sqft column)

In [115]:
df5 = df4.copy()

In [116]:
df5['price_per_sqft'] = df5['price']*100000/df5['total_sqft']
# multiply by 100000 because our price column data is in lakhs
df5.head()

,location,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,1056.0,2.0,1.0,39.07,2,3699.810606
1,Chikka Tirupathi,2600.0,5.0,3.0,120.00,4,4615.384615
2,Uttarahalli,1440.0,2.0,3.0,62.00,3,4305.555556
3,Lingadheeranahalli,1521.0,3.0,1.0,95.00,3,6245.890861
4,Kothanur,1200.0,2.0,1.0,51.00,2,4250.000000

We will use this column later to remove outliers

### Feature Engineering (Dimensionality Reduction on location column)

In [119]:
df5.location = df5.location.apply(lambda x:x.strip())
all_locations = df5.location.value_counts()
all_locations

Whitefield                         538
Sarjapur  Road                     397
Electronic City                    304
Kanakpura Road                     271
Thanisandra                        236
Yelahanka                          212
Uttarahalli                        186
Hebbal                             177
Marathahalli                       175
Raja Rajeshwari Nagar              171
Hennur Road                        152
Bannerghatta Road                  151
7th Phase JP Nagar                 148
Haralur Road                       142
Electronic City Phase II           132
Rajaji Nagar                       107
Chandapura                         100
Bellandur                           96
KR Puram                            91
Electronics City Phase 1            88
Hoodi                               88
Yeshwanthpur                        85
Begur Road                          84
Sarjapur                            81
Harlur                              79
Kasavanhalli                        79
Banashankari                        74
Hormavu                             74
Kengeri                             72
Koramangala                         72
                                  ...
Tilak Nagar                          1
Vayunandana Layout                   1
Karnataka Shabarimala                1
Soppahalli                           1
Vasatha Vallbha Nagar                1
Milk Colony                          1
PC Palaya                            1
Bapuji Layout                        1
Behind Don Bosco Church              1
Cambridge  road                      1
T C Palya main Road                  1
Papareddipalya                       1
2nd Block Hbr Layout                 1
Mukkutam Nagar                       1
Punappa Layout                       1
Air View Colony                      1
banashankari stage iii sa            1
N R Layout                           1
Off Sarjapur road,                   1
Kengeri Satellite Town Stage II      1
Bennigana Halli                      1
Chuchangatta Colony                  1
KHB Colony Extension                 1
Hennur Busstop                       1
CHIKKATIRUPATHI                      1
Amrita Nagar                         1
Jaraganahalli Jp Nagar Post          1
Keerthi Layout                       1
Jeevanhalli                          1
K R C kothanur                       1
Name: location, Length: 1287, dtype: int64

There are total 1287 unique locations so during one hot encoding there will be 1287 new columns will be created which is too high, It is called dimensionality curse.

So to handle that we will create new location called 'Others' and put all locations with less records into that category.

For that we will take threshold limit to 10

In [123]:
len(all_locations[all_locations<10])

1033

In [125]:
location_less_than_10 = all_locations[all_locations<10]

df5.location = df5.location.apply(lambda x: 'other' if x in location_less_than_10 else x)

In [126]:
len(df5.location.unique())

255

So from 1287 we reduce it now to 255 unique locations only.

In [127]:
df5.head(10)

,location,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,1056.0,2.0,1.0,39.07,2,3699.810606
1,Chikka Tirupathi,2600.0,5.0,3.0,120.00,4,4615.384615
2,Uttarahalli,1440.0,2.0,3.0,62.00,3,4305.555556
3,Lingadheeranahalli,1521.0,3.0,1.0,95.00,3,6245.890861
4,Kothanur,1200.0,2.0,1.0,51.00,2,4250.000000
5,Whitefield,1170.0,2.0,1.0,38.00,2,3247.863248
6,Old Airport Road,2732.0,4.0,1.0,204.00,4,7467.057101
7,Rajaji Nagar,3300.0,4.0,1.0,600.00,4,18181.818182
8,Marathahalli,1310.0,3.0,1.0,63.25,3,4828.244275
9,other,1020.0,6.0,1.0,370.00,6,36274.509804